# -*- coding: utf-8 -*-

# (if/elif/else)

# По номеру месяца вывести кол-во дней в нем (без указания названия месяца, в феврале 28 дней)
# Результат проверки вывести на консоль
# Если номер месяца некорректен - сообщить об этом

# Номер месяца получать от пользователя следующим образом
user_input = input("Введите, пожалуйста, номер месяца: ")
month = int(user_input)
print('Вы ввели', month)

if month <= 12:
    if month == 1:
        print("В этом месяце 31 день")
    elif month == 2:
        print("В этом месяце 28 день3")
    elif month == 3:
        print("В этом месяце 31 день")
    elif month == 4:
        print("В этом месяце 30 дней")
    elif month == 5:
        print("В этом месяце 31 день")
    elif month == 6:
        print("В этом месяце 30 дней")
    elif month == 7:
        print("В этом месяце 31 день")
    elif month == 8:
        print("В этом месяце 31 день")
    elif month == 9:
        print("В этом месяце 30 дней")
    elif month == 10:
        print("В этом месяце 31 день")
    elif month == 11:
        print("В этом месяце 30 дней")
    else:
        print("31")
else:
    print("Не верный номер месяца")
#зачет!