# -*- coding: utf-8 -*-

# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."

# В этом модуле создать рецепт двойного чизбургера (https://goo.gl/zA3goZ)
# с помощью фукций из my_burger и вывести на консоль.

# Создать рецепт своего бургера, по вашему вкусу.
# Если не хватает инградиентов - создать соответствующие функции в модуле my_burger


import my_burger

my_burger.add_bulochka('булочку')
my_burger.add_kotlets("котлеты")
my_burger.add_chees('чедер')
my_burger.add_onion('красный лук')
my_burger.add_tomat('помидор')
my_burger.add_souse('горчица')
my_burger.add_priprava('приправой для гриля')
#зачет!